Перем e1cRuntimeКонтекст;
Перем ТекущаяИнструкция;
Перем ИдентификаторКоманды;
Перем ЗавершеннаяКоманда;
Перем Результат;
Перем Ошибка;

Процедура ЗапуститьЯдро() Экспорт

	Сообщить("ЗАПУСК|" + Строка(ТипЗнч(ЭтотОбъект)));
	e1cRuntimeКонтекст = Новый Структура;
	ТекущаяИнструкция = "";
	ИдентификаторКоманды = 0;
	ЗавершеннаяКоманда = 0;
	Результат = Неопределено;
	Ошибка = "";
	Пока Истина Цикл
		Если ИдентификаторКоманды > ЗавершеннаяКоманда Тогда // @runtime-service-breakpoint
			Результат = Неопределено;
			Ошибка = "";
			Попытка
				Выполнить(ТекущаяИнструкция);
			Исключение
				Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			ЗавершеннаяКоманда = ИдентификаторКоманды;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
